# TextStyleBold Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TextStyleBold Property
ParameterTypeId Class See Also
---
"Bold"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TextStyleBold { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextStyleBold As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TextStyleBold {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace